; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(on b1 b11)
(ontable b2)
(on b3 b13)
(on b4 b3)
(on b5 b12)
(on b6 b10)
(on b7 b8)
(on b8 b6)
(on b9 b5)
(on b10 b2)
(on b11 b7)
(ontable b12)
(on b13 b9)
(clear b1)
(clear b4)
)
(:goal
(and
(on b3 b8)
(on b4 b7)
(on b6 b3)
(on b9 b10)
(on b10 b6)
(on b11 b12)
(on b12 b13)
(on b13 b1))
)
)

; plan
1. (move-b-to-t b1 b11)
   deleted: (on b1 b11)
   added: (ontable b1) (clear b11)
   goals met: 0 of 8
2. (move-b-to-t b11 b7)
   deleted: (on b11 b7)
   added: (ontable b11) (clear b7)
   goals met: 0 of 8
3. (move-b-to-t b7 b8)
   deleted: (on b7 b8)
   added: (ontable b7) (clear b8)
   goals met: 0 of 8
4. (move-b-to-t b8 b6)
   deleted: (on b8 b6)
   added: (ontable b8) (clear b6)
   goals met: 0 of 8
5. (move-b-to-b b4 b3 b7)
   deleted: (clear b7) (on b4 b3)
   added: (on b4 b7) (clear b3)
   goals met: 1 of 8
6. (move-b-to-b b3 b13 b8)
   deleted: (clear b8) (on b3 b13)
   added: (on b3 b8) (clear b13)
   goals met: 2 of 8
7. (move-b-to-b b6 b10 b3)
   deleted: (clear b3) (on b6 b10)
   added: (on b6 b3) (clear b10)
   goals met: 3 of 8
8. (move-b-to-b b10 b2 b6)
   deleted: (clear b6) (on b10 b2)
   added: (on b10 b6) (clear b2)
   goals met: 4 of 8
9. (move-b-to-b b13 b9 b1)
   deleted: (clear b1) (on b13 b9)
   added: (on b13 b1) (clear b9)
   goals met: 5 of 8
10. (move-b-to-b b9 b5 b10)
   deleted: (clear b10) (on b9 b5)
   added: (on b9 b10) (clear b5)
   goals met: 6 of 8
11. (move-b-to-b b5 b12 b2)
   deleted: (clear b2) (on b5 b12)
   added: (on b5 b2) (clear b12)
   goals met: 6 of 8
12. (move-t-to-b b12 b13)
   deleted: (clear b13) (ontable b12)
   added: (on b12 b13)
   goals met: 7 of 8
13. (move-t-to-b b11 b12)
   deleted: (clear b12) (ontable b11)
   added: (on b11 b12)
   goals met: 8 of 8
